using System.Collections;
using System.Collections.Generic;
using UnityEngine;

namespace BehaviourModel
{
    /// <summary>
    /// Для низкого значения характерно: эмоциональная неустойчивость, импульсивность;
    /// человек находится под влиянием чувств, переменчив в настроениях, легко расстраивается, 
    /// неустойчив в интересах. Низкая толерантность по отношению к фрустрации, раздражительность, утомляемость.
    /// Для высокого значения характерно: эмоциональная устойчивость, выдержанность;
    /// человек эмоционально зрелый, спокойный, устойчив в интересах, работоспособный, может быть ригидным, ориентирован на реальность.
    /// Этот фактор характеризует динамическое обобщение и зрелость эмоций в противоположность нерегулируемой эмоциональности.
    /// </summary>
    public abstract class EmotionalInstabilityStability : CharacterTraitBase
    {
       
    }
}