using System.Collections;
using System.Collections.Generic;
using UnityEngine;

namespace BehaviourModel
{
    /// <summary>
    /// Для низкого значения характерно: расслабленность, вялость, апатичность, спокойствие,
    /// низкая мотивация, излишняя удовлетворенность, невозмутимость.
    /// Для высокого значения характерно: собранность, энергичность, напряженность, фрустрированность,
    /// повышенная мотивация, беспокойство, взвинченность, раздражительность.
    /// Высокая оценка интерпретируется как энергетическая возбужденность, которая требует
    /// определенной разрядки; иногда это состояние может превратиться в психосоматическое нарушение:
    /// снижается эмоциональная устойчивость, нарушается равновесие, может проявляться агрессивность.
    /// Такие люди редко становятся лидерами.
    /// Исследования показали, что низкая оценка (0–5 баллов) характерна для людей с невысоким уровнем
    /// мотивации достижения, довольствующихся имеющимся. Лица со значениями этого фактора от 5 до 8 баллов 
    /// характеризуются оптимальным эмоциональным тонусом и стрессоустойчивостью.
    /// </summary> 
    public abstract class RelaxationTension : CharacterTraitBase
    {
      
    }
}