using System.Collections;
using System.Collections.Generic;
using UnityEngine;

namespace BehaviourModel
{
    /// <summary>
    /// Для низкого значения характерно: низкая дисциплинированность, следует своим желаниям, 
    /// зависимость от настроений, неумение контролировать свои эмоции и поведение.
    /// Для высокого значения характерно: целенаправленность, сильная воля, умение контролировать свои эмоции и поведение.
    /// Низкие оценки по этому фактору указывают на слабую волю и плохой самоконтроль.
    /// Деятельность таких людей неупорядочена и импульсивна.Личность с высокими оценками по этому фактору
    /// имеет социально одобряемые характеристики: самоконтроль, настойчивость, сознательность, склонность
    /// к соблюдению этикета. Для того, чтобы соответствовать таким стандартам, от личности требуется приложение
    /// определенных усилий, наличие четких принципов, убеждений и учет общественного мнения.
    /// Этот фактор измеряет уровень внутреннего контроля поведения, интегрированность личности.
    /// </summary>
    public abstract class Selfcontrol : CharacterTraitBase
    {
       
    }
}