using System.Collections;
using System.Collections.Generic;
using UnityEngine;

namespace BehaviourModel
{
    /// <summary>
    /// ƒл€ низкого значени€ характерно: м€гкость, уступчивость, тактичность,
    /// кроткость, любезность, зависимость, безропотность, услужливость, почтительность, застенчивость,
    /// готовность брать вину на себ€, скромность, экспрессивность, склонность легко выходить из равновеси€.
    /// ƒл€ высокого значени€ характерно: самосто€тельность, независимость, настойчивость, упр€мство, напористость, 
    /// своенравие, иногда конфликтность, агрессивность, отказ от признани€ внешней власти, склонность к авторитарному поведению, 
    /// жажда восхищени€, бунтарь.
    /// ‘актор ≈ не очень существенно коррелирует с достижени€ми лидерства, 
    /// однако св€зан с социальным статусом и выше у лидеров, чем у последователей.
    /// —уществует предположение, что оценки по этому фактору с возрастом мен€ютс€ и завис€т от пола испытуемого.
    /// ¬ своем поведении люди с высокими оценками (по этому фактору) испытывают потребность в автономии.
    /// </summary>
    public abstract class SubordinationDomination : CharacterTraitBase
    {
   
    }
}