namespace BehaviourModel
{
    /// <summary>
    /// Для низкого значения характерно: склонность к непостоянству, подверженность влиянию чувств,
    /// случая и обстоятельств. Потворствует своим желаниям, не делает усилий по выполнению групповых
    /// требований и норм. Неорганизованность, безответственность, импульсивность, отсутствие согласия
    /// с общепринятыми моральными правилами и стандартами, гибкость по отношению к социальным нормам,
    /// свобода от их влияния, иногда беспринципность и склонность к асоциальному поведению.
    /// Для высокого значения характерно: добросовестность, ответственность, стабильность, уравновешенность,
    /// настойчивость, склонность к морализированию, разумность, совестливость.
    /// Развитое чувство долга и ответственности, осознанное соблюдение общепринятых моральных правил и норм,
    /// настойчивость в достижении цели, деловая направленность.
    /// </summary>
    public abstract class NormativityOfBehaviour : CharacterTraitBase
    {
    }
}