namespace BehaviourModel
{
    /// <summary>
    /// Для низкого значения характерно: несентиментальность, самоуверенность, суровость,
    /// рассудочность, гибкость в суждениях, практичность, иногда некоторая жесткость
    /// и черствость по отношению к окружающим, рациональность, логичность.
    /// Для высокого значения характерно: чувствительность, впечатлительность, богатство
    /// эмоциональных переживаний, склонность к романтизму, художественное восприятие мира,
    /// развитые эстетические интересы, артистичность, женственность, склонность к эмпатии, сочувствию,
    /// сопереживанию и пониманию других людей, утонченная эмоциональность.
    /// Этот фактор отражает различия в культурном уровне и эстетической восприимчивости личности.
    /// Интересен тот факт, что люди с низкими показателями по этому фактору меньше болеют, более агрессивны,
    /// чаще занимаются спортом, атлетичны.
    /// Характеристики этого фактора ближе к фактору второго порядка «низкая эмоциональность
    /// – высокая эмоциональность»; данный фактор является там главенствующим.
    /// Личность с высокими показателями по этому фактору характеризуется как физически и умственно утонченная,
    /// склонная к рефлексии, задумывающаяся над своими ошибками и путями избежания таковых.
    /// </summary>
    public abstract class RigiditySensetivity : CharacterTraitBase
    {
    }
}