namespace BehaviourModel
{
    /// <summary>
    /// ƒл€ низкого значени€ характерно: высока€ скорость решени€ практических задач,
    /// прозаичность, ориентаци€ на внешнюю реальность, развитое конкретное воображение, практичность, реалистичность.
    /// ƒл€ высокого значени€ характерно: богатое воображение, поглощенность своими иде€ми,
    /// внутренними иллюзи€ми(Ђвитает в облакахї), легкость отказа от практических суждений,
    /// умение оперировать абстрактными пон€ти€ми, ориентированность на свой внутренний мир; мечтательность.
    /// ¬ целом фактор ориентирован на измерение особенностей воображени€, отражающихс€ в реальном поведении личности,
    /// таких, как практичность, приземленность или, наоборот, некоторое Ђвитание в облакахї, романтическое отношение к жизни.
    /// </summary>
    public abstract class PracticalityDreaminess : CharacterTraitBase
    {
    }
}