namespace BehaviourModel
{
    /// <summary>
    /// Для низкого значения характерно: консервативность, устойчивость по отношению к традициям, сомнение
    /// в отношении к новых идей и принципов, склонность к морализации и нравоучениям,
    /// сопротивление переменам, узость интеллектуальных интересов, ориентация на конкретную реальную деятельность.
    /// Для высокого значения характерно: свободомыслие, экспериментаторство,
    /// наличие интеллектуальных интересов, развитое аналитическое мышление,
    /// восприимчивость к переменам, к новым идеям, недоверие к авторитетам, отказ принимать что-либо на веру,
    /// направленность на аналитическую, теоретическую деятельность.
    /// В исследованиях было получено доказательство того, что личности с высокими показателями
    /// по этому фактору лучше информированы, меньше склонны к морализаторству, выражают больший интерес к науке,
    /// нежели к догмам.Более того, они готовы к нарушению привычек и устоявшихся традиций,
    /// им свойственна независимость суждений, взглядов и поведения.
    /// Фактор определяет радикальное, интеллектуальное, политическое и религиозное отношения.
    /// </summary>
    public abstract class ConservatismRadicalism : CharacterTraitBase
    {
    }
}