namespace BehaviourModel
{
    /// <summary>
    /// Доверчивость-подозрительность.
    /// Для низкого значения характерно: открытость, уживчивость, терпимость, покладистость;
    /// свобода от зависти, уступчивость. Может быть чувство собственной незначительности.
    /// Для высокого значения характерно: осторожность, эгоцентричность, настороженность по отношению к людям;
    /// склонность к ревности, стремление возложить ответственность за ошибки на окружающих,
    /// раздражительность.Иногда автономность, самостоятельность и независимость в социальном поведении.
    /// В целом фактор отражает эмоциональное отношение к людям.
    /// Очень высокие оценки по этому фактору говорят об излишней защите и эмоциональной напряженности,
    /// фрустрированности личности. Низкий полюс характеризует личность добродушную, но склонную к конформизму.
    /// </summary>
    public abstract class CredulitySuspicion : CharacterTraitBase
    {
    }
}