using System.Collections;
using System.Collections.Generic;
using UnityEngine;

namespace BehaviourModel
{
    /// <summary>
    /// Для низкого значения характерно: робость, застенчивость, эмоциональная сдержанность,
    /// осторожность, социальная пассивность, деликатность, внимательность к другим, повышенная чувствительность к угрозе,
    /// предпочтение индивидуального стиля деятельности и общения в малой группе (2–3 человека).
    /// Для высокого значения характерно: смелость, предприимчивость, активность; 
    /// человек имеет эмоциональные интересы, готовность к риску и сотрудничеству с незнакомыми людьми 
    /// в незнакомых обстоятельствах, способность принимать самостоятельные, неординарные решения,
    /// склонность к авантюризму и проявлению лидерских качеств.
    /// Фактор H – четко определенный фактор, который характеризует степень активности в социальных контактах.
    /// При этом надо учитывать, что этот фактор имеет генетическое происхождение и отражает активность 
    /// организма и особенности темперамента.Люди с высокими оценками этого фактора имеют склонность к профессиям риска
    /// (летчики-испытатели), упорны, социабельны, умеют выдерживать эмоциональные нагрузки, что часто делает их лидерами.
    /// Низкие оценки этого фактора характеризуют людей застенчивых, робких, не социабельных, 
    /// трудно принимающих самостоятельные решения.
    /// </summary>
    public abstract class TimidityCourage : CharacterTraitBase
    {
   
    }
}