using System.Collections;
using System.Collections.Generic;
using UnityEngine;

namespace BehaviourModel
{
    /// <summary>
    /// —тепень независимости, свободы от мнений других людей.
    /// ƒл€ низкого значени€ характерно: зависимость от мнени€ и требований группы, социабельность, следование за общественным мнением, стремление работать и принимать решени€ вместе с другими людьми, низка€ самосто€тельность, ориентаци€ на социальное одобрение.
    /// ƒл€ высокого значени€ характерно: независимость, ориентаци€ на собственные решени€, 
    /// самосто€тельность, находчивость, стремление иметь собственное мнение.
    /// ѕри крайних высоких оценках склонность к противопоставлению себ€ группе и желание в ней доминировать.
    /// Ќизкие оценки по этому фактору имеют личности общительные, дл€ которых много значит одобрение общества,
    /// это светские люди.
    /// ¬ысокие оценки имеют люди, которые часто разобщены с группой и по роду зан€тий €вл€ютс€ индивидуалистами Ц писатели,
    /// ученые и преступники.
    /// </summary>
    public abstract class ConformismNonconformism : CharacterTraitBase
    {
      
    }
}