namespace BehaviourModel
{
    /// <summary>
    /// Спокойствие-тревожность. Низкие оценки характерны для людей,
    /// которые «управляют своими неудачами». Личность с высокими оценками по этому фактору
    /// чувствует свою неустойчивость, напряженность в трудных жизненных ситуациях,
    /// легко теряет присутствие духа, полна сожалений и сострадания;
    /// для нее характерна комбинация симптомов ипохондрии и неврастении с преобладанием страхов.
    /// Этот фактор шире, чем чувство вины в общепринятом смысле.
    /// </summary>
    public abstract class CalmnessAnxiety : CharacterTraitBase
    {
        
    }
}