using System.Collections;
using System.Collections.Generic;
using UnityEngine;

namespace BehaviourModel
{
    /// <summary>
    /// ƒл€ низкого значени€ характерно: конкретность и некотора€ ригидность мышлени€, затруднени€ 
    /// в решении абстрактных задач, сниженна€ оперативность мышлени€, недостаточный уровень общей вербальной культуры.
    /// ƒл€ высокого значени€ характерно: развитое абстрактное мышление, оперативность, сообразительность, 
    /// быстра€ обучаемость.ƒостаточно высокий уровень общей культуры, особенно вербальной.
    /// ‘актор ¬ не определ€ет уровень интеллекта, он ориентирован на измерение оперативности мышлени€ 
    /// и общего уровн€ вербальной культуры и эрудиции.—ледует отметить, 
    /// что низкие оценки по этому фактору могут зависеть от других характеристик личности:
    /// тревожности, фрустрированности, низкого образовательного ценза.
    /// </summary>
    public abstract class Intelligence : CharacterTraitBase
    {
        
    }
}